Revit 2024 API
AnalyticalElement.IsValidAnalyzeAs Method
 Checks whether the value set for Analyze As is valid for an Analytical Element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public bool IsValidAnalyzeAs(
	AnalyzeAs analyzeAs
)
Visual Basic
Public Function IsValidAnalyzeAs ( _
	analyzeAs As AnalyzeAs _
) As Boolean
Visual C++
public:
bool IsValidAnalyzeAs(
	AnalyzeAs analyzeAs
)
Parameters
analyzeAs
Type: Autodesk.Revit.DB.Structure.AnalyzeAs
 The value set to be verified.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
AnalyticalElement Class
Autodesk.Revit.DB.Structure Namespace